; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:  Hrant Ohanyan »»» hrantohanyan@mail.am
; Homepage:     http://www.armsoft.info
; Armenian file: Armenian translation 
;
; Translation Instructions:
;       Copy this file to a new file named after the new language
;               Eg: A language file for the German language would be named German.ini.
;       Replace the English words and phrases with their native equivalents,
;               attempting to match the English phrasing and case-sensitivity as
;               closely as possible for the sake of consistency
;       Update the Author and Homepage information at the top of your new language
;               file.  Simply delete the Homepage line if you don't have one.
;       E-mail new language files to jbreland@legroom.net for inclusion in main
;               Universal Extractor installer
;
;       The following symbols have special meanings:
;       & - when used in a GUI label or button, it precedes the letter that will
;               be registered as a "hotkey" for that function
;       %n - indicates a newline character, which will be replaced when displayed
;       %t - indicates a tab character, which will be replaced when displayed
;       %s - indicates a string variable that UniExtract will replace when displayed
;               The contents each %s variables is hardocded into UniExtract.
;               The order and number of %s variables is very important and should not
;               be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&ԼԱՎ"
CANCEL_BUT = "&Մերժել"
MAIN_DEST_DIR_LABEL = "&Թղթապանակը."
MAIN_FILE_LABEL = "&Արխիվ/Ֆայլ, որը պետք է բացել."
MENU_FILE_LABEL = "&Ֆայլ"
MENU_FILE_QUIT_LABEL = "&Դուրս գալ"
MENU_EDIT_LABEL = "&Խմբագրել"
MENU_EDIT_PREFS_LABEL = "&Նախընտրանքներ"
MENU_HELP_LABEL = "&Օգնություն"
MENU_HELP_WEB_LABEL = "%s ծրագրի կայքը"
PREFS_TITLE_LABEL = "Նախընտրանքներ"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractor-ի ընտրանքները"
PREFS_HISTORY_LABEL = "Պահպանել &պատմությունը"
PREFS_FORMAT_OPTS_LABEL = "Ձևաչափի հատուկ ընտրանքները"
PREFS_LANG_LABEL = "&Լեզուն"
PREFS_DEBUG_LABEL = "&Պահպանել ֆայլը"
PREFS_WARN_EXECUTE_LABEL = "&Հարցնել ֆայլերը բացելուց առաջ"
PREFS_REMOVE_DUPE_LABEL = "&Ջնջել ֆայլերի կրկնօրինակները"
PREFS_REMOVE_TEMP_LABEL = "Ջնջել &ժամանակավոր ֆայլերը"
PREFS_APPEND_EXT_LABEL = "&Ավելացնել ընդլայնում"
METHOD_ADMIN_RADIO = "%s Ադմինիստրատիվ տեղակայիչ"
METHOD_EXTRACTION_RADIO = "%s բացվում է"
METHOD_HEADER = "%s Բացվում է"
METHOD_MSI_NOTE_LABEL = "Նշում."
METHOD_MSI_REQUIRES_LABEL = "պահանջում է msi2xml"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Բացելու եղանակը"
METHOD_SWITCH_RADIO = "%s անցում"
METHOD_NOTIS_RADIO = "Սա InstallShield տեղակայման ֆայլ չէ"
METHOD_TEXT_LABEL = "%s-ը աջակցում է բացելու հետևյալ եղանակները. %s. Ցավոք այս եղանակներից ոչ մեկը հուսալի չէ 100 %-ով: Եթե տրված եղանակը չի աշխատում, բացեք %s նորից և ընտրեք համարժեք այլ մեթոդ:"
METHOD_UNPACKER_RADIO = "%s Բացիչ"

; GUI control functions
DOES_NOT_EXIST = "գոյություն չունի.%n"
EXTRACT_TO = "Բացել"
INVALID_DIR_SELECTED =  "%s Սխասլ թղթապանակ"
INVALID_FILE_SELECTED = "%s Խնդրում ենք ընտրել ճիշտ թղթապանակ:"
OPEN_FILE = "Բացել ֆայլը"
SELECT_FILE = "Ընտրել ֆայլը"
WRITE_TO = "Պահպանել"

; Common terms
TERM_ARCHIVE = "արխիվ"
TERM_COMPRESSED = "սեղմված ֆայլ"
TERM_DISK = "պնակ"
TERM_EBOOK = "էլ. գիրք"
TERM_ECARD = "էլ. քարտ"
TERM_ENCODED = "կոդավորված ֆայլ"
TERM_EXECUTABLE = "օգտագործվող ֆայլ"
TERM_FAILED = "անհաջող"
TERM_HELP = "Օգնության ֆայլը"
TERM_HOTFIX = "хотфикс"
TERM_IMAGE = "դիտել"
TERM_INSTALLER = "տեղակայիչ"
TERM_PACKAGE = "փաթեթը"
TERM_PATCH = "ուղղում"
TERM_SFX = "Ինքնաբացվող արխիվ"
TERM_STAGE = "Մակարդակը"
TERM_SUCCEEDED = "հաջորդ"
TERM_TESTING = "Թեսթավորում"
TERM_UNKNOWN = "անհայտ"
TERM_UNPACKED = "չփաթեթավորված"
TERM_UPDATER = "թարմացում"

; Status messages
SCANNING_FILE = "Ստուգվում է ֆայլի տեսակը:"
SCANNING_EXE = "Ֆայլը ստուգվում է %s-ի օգնությամբ"
EXTRACTING = "Հանվում են ֆայլերը`"
INIT_WAIT = "%n բացվում է, խնդրում ենք սպասել:"

; Custom prompts
CONVERT_CDROM = "CD արտացոլանքները միանգամից հնարավոր չէ բացել: %n արտացոլանքտը կփոխվի ISO-ի, որը և կբացվի:%n%nՇարունակե՞լ:%n"
CONVERT_CDROM_STAGE1_FAILED = "Սխալ. CD արտացոլանքը չի կարող ձևափոխվել;%nԵթե սա BIN/CUE է, ապա համոզվե, որ CUE ֆայլը ճիշտ է:"
CONVERT_CDROM_STAGE2_FAILED = "Սխալ. ISO արտացոլանքը ստեղծվել է %s արտացոլանքից,այն չի կարող ձևափոխվել:%nՑանկանում ե՞ք պահպանել ISO արտացելանքը:"
CONVERT_BIN_MISSING = "Սխալ. Չի գտնվել. %n%s\%s.%s%n%nԱշխատանքի համար անհրաժեշտ են  - %s.BIN և %s.CUE - ֆայլերը:"
INIT_COMPLETE = "%s-ի որոշում: Ընտրեք տեղակայման ֆայլից և սեղմեք ԼԱՎ` շարունակելու համար:"
WISE_MSI_PROMPT = "Ուշադրություն. այս եղանակը աշխատում է միայն Windows Installer-ի որոշակի փաթեթների հետ:%nԵթե Wise Installation Wizard-ը բացվի և կանգնի ընթացքում, ապա նշանակում է ֆայլի ձևաչափը չի աջակցվում:%n Փակեք տեղակայման փաթեթը և %s բացումը կընդհատվի:%n%nՇարունակե՞լ:"
UNPACK_PROMPT = "Այս ֆայլը սեղմված է %s սեղմամբ:%n%nԲացե՞լ ֆայլը:%n%n
UNPACK_FAILED = "Սխալ. %s%nչի կարող բացվել:"
WARN_EXECUTE = "Զգուշացում. Այս տիպի ֆայլը բացելու համար, ֆայլը պետք է բացվի:%nԵթե Դուք շարունակեք կկատարվի հետևյալ հրամանը.%n%n%s%%nՇարունակե՞լ:"

; Help text
HELP_SUMMARY = "Ցանկացած տեսակի արխիվից և տեղակայման փաթեթից ֆայլերի հանում"
HELP_SYNTAX = "%nՕգտագործել.  %s [/help] [filename [destination]]"
HELP_ARGUMENTS = "%n%nԱջակցվող ձևաչափեր."
HELP_HELP = "%n     /օգնություն%t%tՑույց տալ օգնությունը"
HELP_FILENAME = "%n     անունը%tԲացվող ֆայլի անունը"
HELP_DESTINATION = "%n     հասցեն%tբացելու համար թղթապանակներ"
HELP_SUB = "%n%nԲաց թողնել /sub նշանակման թղթապանակի անվան փոխարեն %n%s արխիվի անունով ենթաթղթապանակ:"
HELP_EXAMPLE1 = "%n%nՕրինակ."
HELP_EXAMPLE2 = "%n     %s c:\1\Ex.zip c:\թեսթ"
HELP_NOARGS = "%n%n%s-ը բացելիս առանց ձևաչափերի %nհարցում է տրված նշանակման ֆայլի և թղթապանակի անվան մասին:"

; Error messages
CANNOT_LOG = "%s հնարավոր չէ գրանցել:"
CANNOT_DEBUG = ""%s" թղթապանակում հնարավոր չէ պահպանել:%nՖայլը կպահպանվի ժամանակավոր թղթապանակում:"
CANNOT_EXTRACT = "%s հնարավոր չէ բացել:%nՖայլի տեսակը.%s%n%nՍեղմեք ԼԱՎ, եթե ցանկանում եք ստուգել ֆայլը, "Հրաժարվել"`դուրս գալու համար:"
UNKNOWN_EXT = "%s%nունի անհայտ ձևաչափ և չի կարող բացվել:"
INVALID_DIR = "%s%n հնարավոր չէ ստեղծել:"
EXTRACT_FAILED = "%s չի կարող բացվել:%nՀնարավոր է %s աջակցվում է, բայց բացումը անհաջող էր:%n"

[Installer]
; Components page
COMP_DOCS = "Տեղեկություն լիցենզիայի մասին"
COMP_LANG = "Լեզվի ֆայլերը"
COMP_ACE = "ACE ֆայլերի աջակցում"
COMP_KGB = "KGB ֆայլերի աջակցում"
COMP_PEA = "Pea ֆայլերի աջակցում"
COMP_SIT = "StuffIt ֆայլերի աջակցում"

; Preferences page
PREFS_CAPTION = "Ծրագրի ընտրանքները"
PREFS_DESCRIPTION = "Universal Extractor-ի ինչպիսի ընտրանքներ հաստատել:"
PREFS_LABEL1 = "Հնարավոր է հաստատել հետևյալ ընտրանքները:"
PREFS_LABEL2 = "Այս ընտրանքները հնարավոր է փոխել տեղակայումից հետո` UniExtract.ini ֆայլը խմբագրելով:"
LANGUAGE_LABEL = "Լեզուն"
DEBUG_LABEL = "Ֆայլի տեղադրությունը"
APPEND_EXT_LABEL = "&Ավելացրեք ֆայլի բացակայող ընդլայնումները"
HISTORY_LABEL = "&Արխիվի պահպանված պատմությունը"
REMOVE_DUPE_LABEL = "Ջնջել &ֆայլերի կրկնօրինակները"
REMOVE_TEMP_LABEL = "Ջնջել &ժամանակավոր ֆայլերը"
WARN_EXECUTE_LABEL = "&Հարցնել` ֆայլերը բացելիս"

; Tasks page
ASSOCIATE = "&Ներմուծում Ուղեցույցի համատեքստային ընտրացանկում"
ASSOCIATE_FILES = "Ավելացնել 'UniExtract &Ֆայլում' համատեքստային ընտրացանկ"
ASSOCIATE_HERE = "Ավելացնել 'UniExtract &այստեղ' համատեքստային ընտրացանկ"
ASSOCIATE_SUBDIR = "Ավելացնել 'UniExtract &թղթապանակում' համատեքստային ընտրացանկ"
ASSOCIATE_FORCE = "Ասոցացնել &բոլոր աջակցվող արխիվների հետ"
MODIFY_PATH = "Ավելացնել Universal Extractor System&Path-ում"
DESKTOP_ICON = "Էկրանի վրա տեղծել &պիտակը"
QUICK_LAUNCH_ICON = "Ստեղծել պիտակը &արագ բացման վահանակին"
SENDTO_ICON = "Ստեղծել "Ուղարկել..." պիտակը"

; Context Menu integration
EXTRACT_FILES = "UniExtract &ֆայլեր"
EXTRACT_HERE = "UniExtract &այստեղ"
EXTRACT_SUB = "UniExtract &թղթապանակում"
